In [1]:
# import libraries
import pandas as pd
import sqlite3

import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# connect to database
conn = sqlite3.connect(':memory:')

# create cursor object
cur = conn.cursor()

In [3]:
# inaugural Jersey City Citi Bike info, September 2015 - August 

jc201510 = pd.read_csv('jc_citi_files/JC-201510-citibike-tripdata.csv')
jc201511 = pd.read_csv('jc_citi_files/JC-201511-citibike-tripdata.csv')
jc201512 = pd.read_csv('jc_citi_files/JC-201512-citibike-tripdata.csv')
jc201601 = pd.read_csv('jc_citi_files/JC-201601-citibike-tripdata.csv')
jc201602 = pd.read_csv('jc_citi_files/JC-201602-citibike-tripdata.csv')
jc201603 = pd.read_csv('jc_citi_files/JC-201603-citibike-tripdata.csv')
jc201604 = pd.read_csv('jc_citi_files/JC-201604-citibike-tripdata.csv')
jc201605 = pd.read_csv('jc_citi_files/JC-201605-citibike-tripdata.csv')
jc201606 = pd.read_csv('jc_citi_files/JC-201606-citibike-tripdata.csv')
jc201607 = pd.read_csv('jc_citi_files/JC-201607-citibike-tripdata.csv')
jc201608 = pd.read_csv('jc_citi_files/JC-201608-citibike-tripdata.csv')
jc201609 = pd.read_csv('jc_citi_files/JC-201609-citibike-tripdata.csv')

In [4]:
to_append = [jc201511, jc201512, jc201601, jc201602, jc201603, 
             jc201604, jc201605, jc201606, jc201607, jc201608, jc201609]

jc_first_year = jc201510.append(to_append, ignore_index=True)

In [5]:
jc_first_year.to_sql('jc_first_year', con = conn, index=False)

/usr/local/Caskroom/miniconda/base/lib/python3.7/site-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [6]:
jc_first_year.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227242 entries, 0 to 227241
Data columns (total 15 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Trip Duration            227242 non-null  int64
 1   Start Time               227242 non-null  object
 2   Stop Time                227242 non-null  object
 3   Start Station ID         227242 non-null  int64
 4   Start Station Name       227242 non-null  object
 5   Start Station Latitude   227242 non-null  float64
 6   Start Station Longitude  227242 non-null  float64
 7   End Station ID           227242 non-null  int64
 8   End Station Name         227242 non-null  object
 9   End Station Latitude     227242 non-null  float64
 10  End Station Longitude    227242 non-null  float64
 11  Bike ID                  227242 non-null  int64
 12  User Type                227002 non-null  object
 13  Birth Year               207550 non-null  float64
 14  Gender                   227242 non-null  int64
dtypes: float64(5), int64(5), object(5)
memory usage: 26.0+ MB

In [7]:
# Total trips October 2015 through September 2016 

cur.execute("""SELECT COUNT(*) AS total_first_year_trips
               FROM jc_first_year
               ;
            """)                                                  # sql query
total_inaug_trips = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
total_inaug_trips.columns = [x[0] for x in cur.description]       # labels dataframe
total_inaug_trips                                                 # view dataframe

   total_first_year_trips
0                  227242

In [8]:
# malfunctioning bikes?

cur.execute("""SELECT COUNT(*) AS total_first_year_malfunctions               
               FROM jc_first_year
               WHERE "Trip Duration" < 90 AND "Start Station Name" = "End Station Name";
            """)                                                  # sql query
total_inaug_mal = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
total_inaug_mal.columns = [x[0] for x in cur.description]       # labels dataframe
total_inaug_mal                                                 # view dataframe

   total_first_year_malfunctions
0                            354

In [9]:
227242-354

226888

In [10]:
# Jersey City Citi Bike info, September 2018 - August 2019

jc201810 = pd.read_csv('jc_citi_files/JC-201810-citibike-tripdata.csv')
jc201811 = pd.read_csv('jc_citi_files/JC-201811-citibike-tripdata.csv')
jc201812 = pd.read_csv('jc_citi_files/JC-201812-citibike-tripdata.csv')
jc201901 = pd.read_csv('jc_citi_files/JC-201901-citibike-tripdata.csv')
jc201902 = pd.read_csv('jc_citi_files/JC-201902-citibike-tripdata.csv')
jc201903 = pd.read_csv('jc_citi_files/JC-201903-citibike-tripdata.csv')
jc201904 = pd.read_csv('jc_citi_files/JC-201904-citibike-tripdata.csv')
jc201905 = pd.read_csv('jc_citi_files/JC-201905-citibike-tripdata.csv')
jc201906 = pd.read_csv('jc_citi_files/JC-201906-citibike-tripdata.csv')
jc201907 = pd.read_csv('jc_citi_files/JC-201907-citibike-tripdata.csv')
jc201908 = pd.read_csv('jc_citi_files/JC-201908-citibike-tripdata.csv')
jc201909 = pd.read_csv('jc_citi_files/JC-201909-citibike-tripdata.csv')

In [11]:
to_append = [jc201811, jc201812, jc201901, jc201902, jc201903, 
             jc201904, jc201905, jc201906, jc201907, jc201908, jc201909]

jc_oct18_sep19 = jc201810.append(to_append, ignore_index=True)

In [12]:
jc_oct18_sep19.to_csv('jc_oct18_sep19.csv', index=False)

In [13]:
jc_oct18_sep19.to_sql('jc_oct18_sep19', con = conn, index=False)

/usr/local/Caskroom/miniconda/base/lib/python3.7/site-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [14]:
jc_oct18_sep19.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,152,2018-10-01 07:44:41.4170,2018-10-01 07:47:14.2960,3183,Exchange Place,40.716247,-74.033459,3639,Harborside,40.719252,-74.034234,15302,Subscriber,1971,2
1,122,2018-10-01 08:50:05.4340,2018-10-01 08:52:08.2250,3183,Exchange Place,40.716247,-74.033459,3214,Essex Light Rail,40.712774,-74.036486,29654,Subscriber,1973,1
2,211,2018-10-01 09:03:17.0640,2018-10-01 09:06:48.0940,3183,Exchange Place,40.716247,-74.033459,3187,Warren St,40.721124,-74.038051,33621,Subscriber,1958,1
3,342,2018-10-01 10:13:07.0090,2018-10-01 10:18:49.8960,3183,Exchange Place,40.716247,-74.033459,3202,Newport PATH,40.727224,-74.033759,26266,Subscriber,1982,1
4,2976,2018-10-01 10:45:14.2800,2018-10-01 11:34:51.2610,3183,Exchange Place,40.716247,-74.033459,3183,Exchange Place,40.716247,-74.033459,27083,Customer,1969,0

In [15]:
# Total trips September 2018 through August 2019 

cur.execute("""SELECT COUNT(*) AS oct18_through_sep19_trips
               FROM jc_oct18_sep19
               ;
            """)                                                  # sql query
jc_oct18_sep19_trips = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
jc_oct18_sep19_trips.columns = [x[0] for x in cur.description]       # labels dataframe
jc_oct18_sep19_trips                                                 # view dataframe

   oct18_through_sep19_trips
0                     396422

In [16]:
# Malfunctioning bikes September 2018 through August 2019 

cur.execute("""SELECT COUNT(*) AS oct18_through_sep19_trips
               FROM jc_oct18_sep19
               WHERE tripduration < 90 AND "Start Station Name" = "End Station Name";
            """)                                                  # sql query
jc_oct18_sep19_mal = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
jc_oct18_sep19_mal.columns = [x[0] for x in cur.description]       # labels dataframe
jc_oct18_sep19_mal                                                 # view dataframe

   oct18_through_sep19_trips
0                        481

In [17]:
396422-481

395941

In [18]:
# % increase
round(((395941-226888)/226888 * 100), 2)

74.51

In [19]:
226888*1.7451

395942.2488

## Trips December 2018 through November 2019

In [20]:
jc12 = pd.read_csv('jc_citi_files/JC-201812-citibike-tripdata.csv')
jc1 = pd.read_csv('jc_citi_files/JC-201901-citibike-tripdata.csv')
jc2 = pd.read_csv('jc_citi_files/JC-201902-citibike-tripdata.csv')
jc3 = pd.read_csv('jc_citi_files/JC-201903-citibike-tripdata.csv')
jc4 = pd.read_csv('jc_citi_files/JC-201904-citibike-tripdata.csv')
jc5 = pd.read_csv('jc_citi_files/JC-201905-citibike-tripdata.csv')
jc6 = pd.read_csv('jc_citi_files/JC-201906-citibike-tripdata.csv')
jc7 = pd.read_csv('jc_citi_files/JC-201907-citibike-tripdata.csv')
jc8 = pd.read_csv('jc_citi_files/JC-201908-citibike-tripdata.csv')
jc9 = pd.read_csv('jc_citi_files/JC-201909-citibike-tripdata.csv')
jc10 = pd.read_csv('jc_citi_files/JC-201910-citibike-tripdata.csv')
jc11 = pd.read_csv('jc_citi_files/JC-201911-citibike-tripdata.csv')

In [21]:
to_append = [jc1, jc2, jc3, jc4, jc5, jc6, jc7, jc8, jc9, jc10, jc11]

jc_trips = jc12.append(to_append, ignore_index=True)

In [22]:
jc_trips.to_csv('jc_trips1819.csv', index=False)
jc_trips.to_sql('jc_trips', con = conn, index=False)

/usr/local/Caskroom/miniconda/base/lib/python3.7/site-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [23]:
jc_trips = pd.read_csv('jc_trips1819.csv')

In [24]:
jc_trips.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,170,2018-12-01 00:03:53.3860,2018-12-01 00:06:43.7160,3183,Exchange Place,40.716247,-74.033459,3214,Essex Light Rail,40.712774,-74.036486,26261,Subscriber,1975,1
1,172,2018-12-01 00:47:13.7340,2018-12-01 00:50:05.8160,3183,Exchange Place,40.716247,-74.033459,3481,York St,40.716490,-74.041050,26175,Subscriber,1988,1
2,247,2018-12-01 00:48:57.6960,2018-12-01 00:53:05.6780,3183,Exchange Place,40.716247,-74.033459,3267,Morris Canal,40.712419,-74.038526,29255,Subscriber,1990,1
3,406,2018-12-01 01:33:53.6630,2018-12-01 01:40:39.7480,3183,Exchange Place,40.716247,-74.033459,3638,Washington St,40.724294,-74.035483,29275,Subscriber,1995,1
4,354,2018-12-01 06:26:52.5120,2018-12-01 06:32:46.5170,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,29658,Subscriber,1976,1

In [25]:
cur.execute("""SELECT *
               FROM jc_trips
               ;
            """)                                            # sql query
jc = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
jc.columns = [x[0] for x in cur.description]       # labels dataframe
jc                                                 # view dataframe

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,170,2018-12-01 00:03:53.3860,2018-12-01 00:06:43.7160,3183,Exchange Place,40.716247,-74.033459,3214,Essex Light Rail,40.712774,-74.036486,26261,Subscriber,1975,1
1,172,2018-12-01 00:47:13.7340,2018-12-01 00:50:05.8160,3183,Exchange Place,40.716247,-74.033459,3481,York St,40.716490,-74.041050,26175,Subscriber,1988,1
2,247,2018-12-01 00:48:57.6960,2018-12-01 00:53:05.6780,3183,Exchange Place,40.716247,-74.033459,3267,Morris Canal,40.712419,-74.038526,29255,Subscriber,1990,1
3,406,2018-12-01 01:33:53.6630,2018-12-01 01:40:39.7480,3183,Exchange Place,40.716247,-74.033459,3638,Washington St,40.724294,-74.035483,29275,Subscriber,1995,1
4,354,2018-12-01 06:26:52.5120,2018-12-01 06:32:46.5170,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,29658,Subscriber,1976,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
405419,77,2019-11-30 23:30:07.7850,2019-11-30 23:31:25.7730,3638,Washington St,40.724294,-74.035483,3202,Newport PATH,40.727224,-74.033759,29492,Subscriber,1979,1
405420,145,2019-11-30 23:40:45.3790,2019-11-30 23:43:10.5660,3211,Newark Ave,40.721525,-74.046305,3278,Monmouth and 6th,40.725685,-74.048790,40971,Subscriber,1978,1
405421,99,2019-11-30 23:41:55.3310,2019-11-30 23:43:34.3320,3792,Columbus Dr at Exchange Pl,40.716870,-74.032810,3639,Harborside,40.719252,-74.034234,26198,Subscriber,1991,1
405422,594,2019-11-30 23:52:50.2410,2019-12-01 00:02:44.2960,3213,Van Vorst Park,40.718489,-74.047727,3639,Harborside,40.719252,-74.034234,29527,Subscriber,1981,1
405423,329,2019-11-30 23:56:27.6680,2019-12-01 00:01:57.0120,3185,City Hall,40.717733,-74.043845,3267,Morris Canal,40.712419,-74.038526,26163,Subscriber,1977,1

In [35]:
# Most Popular Originations By Customer 

cur.execute("""SELECT   "start station name",
                        COUNT(*) AS most_popular
               FROM jc_trips
               WHERE usertype = "Customer"
               GROUP BY 1
               ORDER BY 2 DESC
               LIMIT 10
               ;
            """)                                            # sql query
cust_starts = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
cust_starts.columns = [x[0] for x in cur.description]       # labels dataframe
cust_starts                                                 # view dataframe

   start station name  most_popular
0  Liberty Light Rail          2749
1       Grove St PATH          2439
2        Newport Pkwy          2145
3          Harborside          2046
4    Marin Light Rail          1916
5        Newport PATH          1744
6       Hamilton Park          1646
7             Sip Ave          1641
8       Washington St          1402
9   JC Medical Center          1363

In [37]:
# Most Popular Originations By Subscribers 

cur.execute("""SELECT   "start station name",
                        COUNT(*) AS most_popular
               FROM jc_trips
               WHERE usertype = "Subscriber"
               GROUP BY 1
               ORDER BY 2 DESC
               LIMIT 10
               ;
            """)                                            # sql query
sub_starts = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
sub_starts.columns = [x[0] for x in cur.description]       # labels dataframe
sub_starts                                                 # view dataframe

  start station name  most_popular
0      Grove St PATH         44502
1      Hamilton Park         22625
2            Sip Ave         17434
3         Harborside         15725
4       Newport PATH         15545
5   Marin Light Rail         12136
6         Newark Ave          9589
7          City Hall          9137
8    Brunswick & 6th          9028
9          Warren St          9020

In [38]:
# Most Popular Destinations By Customer 

cur.execute("""SELECT   "end station name",
                        COUNT(*) AS most_popular
               FROM jc_trips
               WHERE usertype = "Customer"
               GROUP BY 1
               ORDER BY 2 DESC
               LIMIT 10
               ;
            """)                                            # sql query
cust_ends = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
cust_ends.columns = [x[0] for x in cur.description]       # labels dataframe
cust_ends                                                 # view dataframe

     end station name  most_popular
0  Liberty Light Rail          3118
1       Grove St PATH          3110
2        Newport Pkwy          2225
3    Marin Light Rail          1955
4          Harborside          1870
5        Newport PATH          1855
6       Hamilton Park          1624
7             Sip Ave          1551
8       Washington St          1549
9         Paulus Hook          1465

In [39]:
# Most Popular Destinations By Subscibers 

cur.execute("""SELECT   "end station name",
                        COUNT(*) AS most_popular
               FROM jc_trips
               WHERE usertype = "Subscriber"
               GROUP BY 1
               ORDER BY 2 DESC
               LIMIT 10
               ;
            """)                                            # sql query
sub_ends = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
sub_ends.columns = [x[0] for x in cur.description]       # labels dataframe
sub_ends                                                 # view dataframe

             end station name  most_popular
0               Grove St PATH         55741
1               Hamilton Park         20544
2                     Sip Ave         16655
3                Newport PATH         15909
4                  Harborside         15903
5            Marin Light Rail         12065
6                  Newark Ave         10027
7                   City Hall          9504
8  Columbus Dr at Exchange Pl          9224
9                Newport Pkwy          9010

In [41]:
# most popular Customer trip

cur.execute('''SELECT "start station name",
                      "end station name",
                       COUNT(*) AS num_of_trips 
               FROM jc_trips
               WHERE usertype = "Customer"
               GROUP BY 1,2
               ORDER BY 3 DESC
               LIMIT 5;''')                                        # sql query
most_pop_cust_trip = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
most_pop_cust_trip.columns = [x[0] for x in cur.description]       # labels dataframe
most_pop_cust_trip                                                 # view dataframe

   start station name    end station name  num_of_trips
0  Liberty Light Rail  Liberty Light Rail          1360
1        Newport Pkwy        Newport Pkwy           644
2    Marin Light Rail    Marin Light Rail           447
3   JC Medical Center   JC Medical Center           423
4        Lincoln Park        Lincoln Park           275

In [42]:
# most popular Subscriber trip

cur.execute('''SELECT "start station name",
                      "end station name",
                       COUNT(*) AS num_of_trips 
               FROM jc_trips
               WHERE usertype = "Subscriber"
               GROUP BY 1,2
               ORDER BY 3 DESC
               LIMIT 5;''')                                        # sql query
most_pop_sub_trip = pd.DataFrame(cur.fetchall())                  # create dataframe from sql query
most_pop_sub_trip.columns = [x[0] for x in cur.description]       # labels dataframe
most_pop_sub_trip                                                 # view dataframe

  start station name end station name  num_of_trips
0      Hamilton Park    Grove St PATH          8636
1      Grove St PATH    Hamilton Park          6034
2    Brunswick & 6th    Grove St PATH          5008
3    Jersey & 6th St    Grove St PATH          4349
4   Marin Light Rail    Grove St PATH          4251

In [ ]:
jc_trips.info()

In [ ]:
bins=[90,120,180,240,300,360,420,480,540,600,660,720,780,840,900,960,1020,1080,1140,1200,1260,1320,1380,1440,
      1500,1560,1620,1680,1740,1800,1860,1920,1980,2040,2100,2160,2220,2280,2340,2400,2460,2520,2580,2640,
      2700,2760,2820,2880,2940,3000]

plt.hist(jc_trips['tripduration'], bins=bins)

In [ ]:
jc_trips['tripduration'].describe()